{
    "sections":[
        {
            "id": "top",
            "link": "/#top", 
            "text": "Home",  
            "type": "placeholder"
        }, 
        {
            "id": "banner", 
            "link": "no", 
            "type": "banner", 
            "title": "Customer Service Training Courses Ireland", 
            "subtitle": "Contact us for all your Customer Service training requirements", 
            "background": "img/ground@-min.png",
            "image": "svg/onlineclass.svg"
        },
        {
            "id": "keywordtext",
            "link": "/#keywordtext", 
            "text": "About", 
            "title": "About", 
            "type": "keywordtext",
            "image": "/svg/Code Version Control.svg", 
            "imagePosition": "right",
            "content":{
                "title": "The battleground for competitive advantage...",
                "text":[
                    "For many organisations the traditional service performance levels are not sufficient to ensure customer loyalty. The customer experience has become the battle ground for competitive advantage. While many managers focus on internal metrics the customer’s perspective may be neglected.  Effective customer service ensures a link between the organisational strategy and the operational reality experienced by the customer. Successful enterprises identify and mitigate the root causes of gaps in customer service delivery and understand which areas can be improved by individuals, which by the organisation and which require further consideration outside a training programme."
                ]
            }
        },
        {
            "id": "summary",
            "link": "/#summary", 
            "text": "Why Attend?", 
            "title": "Why Attend?", 
            "type": "keywordtext",
            "image": "", 
            "imagePosition": "right",
            "content":{
                "title": "Why attend our Customer Service training courses?",
                "text":[
                    "For client-facing roles, our Customer Service training is designed to provide participants with the competencies required to become an effective representative of the enterprise.",
                    "Our programmes emphasise and hone the ability to communicate effectively and manage customer expectations as a crucial part of the participant’s role as the contact point for their organisation. Our workshops cover the main ways that customers interact with customer service representatives, including face to face, email and telephone communication but also encourage the participants to think creatively about how to improve the customer experience and how their experience and ideas may be incorporated into continuous improvement programme.",
                    "We have extensive experience in workshops designed specifically for technical support staff. These combine the key elements of customer service training with the skills required to present technical information to both technical and non-technical customers. Our content recognises the technical nature of the service provided and the importance of the customer service staff`s role as translators and problem solvers when speaking with customers. We emphasise how communicating, managing expectations and empathizing are increasingly important for IT roles which are business facing.  Our goal is to enable technical experts to gain the core customer service skills that are essential to achieve hard results and deliver responsive technical support."
                ]
            }
        } 
    ] 
}